# copy를 이용한 데이터 복사

* 데이터 생성

In [1]:
import pandas as pd
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

-문제 : 필드명을 a,b,c 에서 d,e,f로 변경하시오.

In [2]:
df.columns = ['d','e','f']

In [3]:
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

-문제: 필드명을 a에서 '에이'로 변경하시오.

In [4]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

In [7]:
df.rename(columns={'a': '에이'}, inplace=True)

In [8]:
df

   에이  b  c
0   1  4  7
1   2  5  8
2   3  6  9

-변수명을 복제하여 해결??

In [9]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})
df2 = df

In [10]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [11]:
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [12]:
df.columns = ['d','e','f']

In [13]:
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [14]:
df2

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

* deep copy 를 통한 해결

In [15]:
import copy

In [16]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})
df2 = copy.deepcopy(df)

In [17]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [18]:
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [19]:
df.columns = ['d','e','f']

In [20]:
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [21]:
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

# 시리즈

* 데이터 생성

In [22]:
import pandas as pd
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

In [23]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

-a 열을 추출하시오

In [24]:
df['a']

0    1
1    2
2    3
Name: a, dtype: int64

In [25]:
type(df['a'])

pandas.core.series.Series

* 시리즈 생성 방법

In [26]:
a = pd.Series([1,2,3,1,2,3])

In [27]:
a

0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64

-인덱스 변경

In [28]:
a = pd.Series([1,2,3,1,2,3], index = ['a','b','c','d','e','f'])

In [29]:
a

a    1
b    2
c    3
d    1
e    2
f    3
dtype: int64

In [30]:
a['e']

2

* 유일한 값 찾기

-아래 테이블(df)의 a 필드의 값들 중 유일한 것들만 추출하시오.

In [31]:
df = pd.DataFrame({'a': [1,2,3,1,2,3], 'b': [4,5,6,6,7,8], 'c': [7,8,9,10,11,12]})

In [32]:
a = df['a']

In [33]:
a

0    1
1    2
2    3
3    1
4    2
5    3
Name: a, dtype: int64

In [34]:
type(a)

pandas.core.series.Series

In [35]:
a.unique()

array([1, 2, 3], dtype=int64)

In [36]:
a.unique()[2]

3

-문제: a,b 열을 추출하시오.

In [37]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

In [38]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [39]:
df['a', 'b']

KeyError: ('a', 'b')

# loc과 iloc을 이용한 원하는 위치의 데이터 추출

- 데이터 생성

In [40]:
import pandas as pd

In [41]:
df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]})

In [42]:
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

-문제: a,b 열을 추출하시오.

In [43]:
df['a', 'b']

KeyError: ('a', 'b')

In [44]:
df[['a','b']]

    a   b
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [45]:
type(df[['a','b']])

pandas.core.frame.DataFrame

In [47]:
df[0]

KeyError: 0

loc을 통한 해결

In [48]:
df.loc[0]

a     1
b    11
c    21
Name: 0, dtype: int64

-슬라이스도 가능

In [49]:
df.loc[2:4]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

-인덱스가 문자로 이루어진 데이터 프레임 생성

In [52]:
index = ['a','b','c','d','e','f','g','g','h','i']

In [53]:
df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]}, index= index)

In [54]:
df

    a   b   c
a   1  11  21
b   2  12  22
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [55]:
df.loc[0]

KeyError: 0

In [57]:
df.loc['g']

   a   b   c
g  7  17  27
g  8  18  28

In [58]:
index = ['a','b','d','c','e','f','g','g','h','i']

In [59]:
df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]}, index= index)

In [60]:
df

    a   b   c
a   1  11  21
b   2  12  22
d   3  13  23
c   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [61]:
df.loc['c':]

    a   b   c
c   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

-문제: 열이 a,c이며 인덱스가 g,i인 데이터를 출력하시오

In [62]:
df

    a   b   c
a   1  11  21
b   2  12  22
d   3  13  23
c   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [63]:
df.loc[['g','i'],['a','c']]

    a   c
g   7  27
g   8  28
i  10  30

-문제: 처음부터 5번째 까지의 데이터와 첫 번째 열과 세 번째 열의 데이터를 추출하시오.

In [64]:
df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]})

In [65]:
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [66]:
df.iloc[:5,[0,2]]

   a   c
0  1  21
1  2  22
2  3  23
3  4  24
4  5  25

In [67]:
index = ['a','b','d','c','e','f','g','g','h','i']
df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]}, index= index)

In [68]:
df

    a   b   c
a   1  11  21
b   2  12  22
d   3  13  23
c   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [70]:
df.iloc[:5, [0,2]]

   a   c
a  1  21
b  2  22
d  3  23
c  4  24
e  5  25

# 조건에 맞는 데이터 추출

- 데이터 생성

In [71]:
import pandas as pd

df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]})

In [72]:
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

-문제: a,c 열을 출력하시오

In [73]:
df[['a', 'c']]

    a   c
0   1  21
1   2  22
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

-문제: a가 3 이상인 데이터를 출력하시오

In [74]:
df[df['a'] >= 3]

    a   b   c
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

-문제: a가 3인 이상인데이터 중 a,c열만 출력하시오

In [75]:
df[df['a'] >= 3][['a','c']]

    a   c
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

-문제: a가 3 이상이고, b가 16미만인 데이터를 출력하시오

In [80]:
df[(df['a'] >= 3) & (df['b'] < 16)]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

In [81]:
a = (df['a'] >= 3) & (df['b'] < 16)

In [83]:
a

0    False
1    False
2     True
3     True
4     True
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [84]:
type(a)

pandas.core.series.Series

In [85]:
df[a]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

-문제: a가 3 이하 이거나 7 이상인 데이터를 출력하시오.

In [86]:
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [87]:
df[(df['a']<=3) | (df['a']>=7)]

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

-문제: a가 3 이상이고, b가 16 미만이거나 c가 30인 데이터를 출력하시오

In [89]:
df[(df['a']>=3)&((df['b']<16) | (df['c'] == 30))]

    a   b   c
2   3  13  23
3   4  14  24
4   5  15  25
9  10  20  30

# 정렬

* 데이터 생성

In [90]:
import pandas as pd

df = pd.DataFrame({'a' : [2,3,2,7,4], 'b' : [2,1,3,5,3], 'c' : [1,1,2,3,5]})

In [91]:
df

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

* 인덱스 기준 정렬

In [92]:
df.sort_index()

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

- 내림차순일때는 ascending = Flase

In [94]:
df.sort_index(ascending=False)

   a  b  c
4  4  3  5
3  7  5  3
2  2  3  2
1  3  1  1
0  2  2  1

결과를 저장하고 싶으면 inplace = True

In [95]:
df.sort_index(ascending=False, inplace= True)

In [96]:
df

   a  b  c
4  4  3  5
3  7  5  3
2  2  3  2
1  3  1  1
0  2  2  1

- 인덱스 초기화는 reset_index()

In [97]:
df.reset_index()

   index  a  b  c
0      4  4  3  5
1      3  7  5  3
2      2  2  3  2
3      1  3  1  1
4      0  2  2  1

In [98]:
df

   a  b  c
4  4  3  5
3  7  5  3
2  2  3  2
1  3  1  1
0  2  2  1

In [100]:
df.reset_index(drop= True, inplace=True)

In [101]:
df

   a  b  c
0  4  3  5
1  7  5  3
2  2  3  2
3  3  1  1
4  2  2  1

* 값 기준 정렬

In [102]:
df = df = pd.DataFrame({'a' : [2,3,2,7,4], 'b' : [2,1,3,5,3], 'c' : [1,1,2,3,5]})

In [103]:
df

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

- 문제: a 열 기준으로 오름차순 정렬하시오

In [104]:
df.sort_values(by= ['a'])

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

In [105]:
df

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

In [106]:
df.sort_values(by= ['a'], inplace= True)

In [107]:
df

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

- a열 기준으로 내림차순 정렬하시오

In [108]:
df.sort_values(by= ['a'], ascending= False)

   a  b  c
3  7  5  3
4  4  3  5
1  3  1  1
0  2  2  1
2  2  3  2

- 문제: a,b 열 기준으로 오름차순 정렬하시오

In [110]:
df.sort_values(by=['a', 'b'])

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

- 문제: a열 기준으로 오름착순 정렬 한 이후, b 열 기준으로 내림차순 정렬하시오

In [111]:
df.sort_values(by=['a', 'b'], ascending=[True, False])

   a  b  c
2  2  3  2
0  2  2  1
1  3  1  1
4  4  3  5
3  7  5  3

In [113]:
# df값에 저장
df.sort_values(by=['a', 'b'], ascending=[True, False], inplace= True)

In [114]:
df.reset_index(drop=True, inplace=True)

In [115]:
df

   a  b  c
0  2  3  2
1  2  2  1
2  3  1  1
3  4  3  5
4  7  5  3

# 결측값 처리

In [117]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'a': [1,1,3,4,5], 'b': [2,3,np.nan,3,4], 'c': [3,4,7,6,4]})

In [118]:
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  NaN  7
3  4  3.0  6
4  5  4.0  4

* 결측 유무 확인

In [119]:
df.isnull()

       a      b      c
0  False  False  False
1  False  False  False
2  False   True  False
3  False  False  False
4  False  False  False

* 결측값 개수 확인

In [120]:
df.isnull().sum()

a    0
b    1
c    0
dtype: int64

* 결측값이 포함된 열 / 행 지우기

-결측값이 포함된 행 지우기

In [121]:
df.dropna()

   a    b  c
0  1  2.0  3
1  1  3.0  4
3  4  3.0  6
4  5  4.0  4

In [123]:
# df에 저장할 때
df.dropna(inplace= True)

* 결측값이 포함된 열 지우기

In [124]:
df = pd.DataFrame({'a': [1,1,3,4,5], 'b': [2,3,np.nan,3,4], 'c': [3,4,7,6,4]})

In [125]:
df.dropna(axis=1)

   a  c
0  1  3
1  1  4
2  3  7
3  4  6
4  5  4

In [126]:
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  NaN  7
3  4  3.0  6
4  5  4.0  4

In [128]:
# df에 값을 저장하고 싶을 때

df.dropna(axis=1, inplace= True)

In [129]:
df

   a  c
0  1  3
1  1  4
2  3  7
3  4  6
4  5  4

*  결측값을 다른 값으로 대체하기

In [130]:
df = pd.DataFrame({'a': [1,1,3,4,5], 'b': [2,3,np.nan,3,4], 'c': [3,4,7,6,4]})

-특정값으로 대체하기

In [131]:
df.fillna(0, inplace= True)

In [132]:
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  0.0  7
3  4  3.0  6
4  5  4.0  4

-앞이나 뒤의 숫자로 바꾸기

In [134]:
df = pd.DataFrame({'a': [1,1,3,4,np.nan], 'b': [2,3,np.nan,np.nan,4], 'c': [np.nan,4,7,6,4]})

In [135]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

1) 뒤의 값으로 채우기

In [136]:
df.fillna(method= 'bfill')

     a    b    c
0  1.0  2.0  4.0
1  1.0  3.0  4.0
2  3.0  4.0  7.0
3  4.0  4.0  6.0
4  NaN  4.0  4.0

In [137]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

2. 뒤의 값으로 채우기

In [138]:
df.fillna(method= 'ffill')

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  3.0  7.0
3  4.0  3.0  6.0
4  4.0  4.0  4.0

- limit 설정

In [140]:
df.fillna(method='ffill', limit=1)

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  3.0  7.0
3  4.0  NaN  6.0
4  4.0  4.0  4.0

- 문제: 데이터 프레임에 존재하는 결측값들을 뒤의 값으로 대체한 이후 앞의 값으로 대체하시오

In [141]:
df = pd.DataFrame({'a': [1,1,3,4,np.nan], 'b': [2,3,np.nan,np.nan,4], 'c': [np.nan,4,7,6,4]})

In [142]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

In [143]:
df.fillna(method='bfill', inplace=True)

In [144]:
df

     a    b    c
0  1.0  2.0  4.0
1  1.0  3.0  4.0
2  3.0  4.0  7.0
3  4.0  4.0  6.0
4  NaN  4.0  4.0

In [145]:
df.fillna(method='ffill', inplace=True)

In [146]:
df

     a    b    c
0  1.0  2.0  4.0
1  1.0  3.0  4.0
2  3.0  4.0  7.0
3  4.0  4.0  6.0
4  4.0  4.0  4.0

- 평균으로 대체

In [147]:
df = pd.DataFrame({'a': [1,1,3,4,np.nan], 'b': [2,3,np.nan,np.nan,4], 'c': [np.nan,4,7,6,4]})

In [148]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

In [149]:
df.mean()['a']

2.25

In [150]:
df.fillna(df.mean()['a'])

      a     b     c
0  1.00  2.00  2.25
1  1.00  3.00  4.00
2  3.00  2.25  7.00
3  4.00  2.25  6.00
4  2.25  4.00  4.00

In [152]:
df.mean()

a    2.25
b    3.00
c    5.25
dtype: float64

In [153]:
df.fillna(df.mean())

      a    b     c
0  1.00  2.0  5.25
1  1.00  3.0  4.00
2  3.00  3.0  7.00
3  4.00  3.0  6.00
4  2.25  4.0  4.00

In [154]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

- 문제: b,c의 결측값들을 데이터 프레임의 전체 값의 평균으로 치환하시오.

In [155]:
df.fillna(df.mean()[['b','c']])

     a    b     c
0  1.0  2.0  5.25
1  1.0  3.0  4.00
2  3.0  3.0  7.00
3  4.0  3.0  6.00
4  NaN  4.0  4.00